# Parameters
nc: 1  # infrared small target — single class
scales:
  n: [0.33, 0.25, 1024]

# YOLOv8n backbone — first two Conv->PConv, rest unchanged
backbone:
  # [from, repeats, module, args]
  - [-1, 1, PConv, [64, 3, 2]]   # 0-P1/2  ← PConv replaces Conv
  - [-1, 1, PConv, [128, 3, 2]]  # 1-P2/4  ← PConv replaces Conv
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]     # 9

# YOLOv8.0n head (unchanged)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]
